"""
分类求数字
A1= 能被 5 整除的数字中所有偶数的和；
A2= 将被 5 除后余 1 的数字按给出顺序进行交错求和，即计算 n1-n2+n3-n4+....
A3= 被 5 除后余 2 的数字的个数；
A4= 被 5 除后余 3 的数字的平均数，精确到小数点后 1 位；
A5= 被 5 除后余 4 的数字中最大数字。
"""


"""列表存储数字"""
L = [10,20,12,1,23,4,9]
A1 = 0
A2 = 0
A2_num = 0
A3 = 0
A4 = 0
A4_num = 0
A5 = 0
for x in L:
    """A1"""
    if x%5==0 and x%2==0:
        A1+=x
    if x%5==1:
        A2_num = A2_num+1
        if A2_num%2==0:
            A2-=x
        else:
            A2+=x
    if x%5==2:
        A3 = A3+1
    if x%5==3:
        A4_num = A4_num+1
        A4 = A4+x
    if x%5==4 and x>A5:
        A5 = x
print(A1,A2,A3,A4/A4_num,A5)
